Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes Constructor
Overload List
Name | Description
DimensionSetBaseAttributes()
 Creates a new default dimension set base attributes instance that loads standard attributes.
DimensionSetBaseAttributes(String)
 Creates a new dimension set base attributes instance that loads the specified attributes.
Top
See Also
Reference
DimensionSetBaseAttributes Class
Tekla.Structures.Drawing Namespace